// 'number' + 3 + 3
// Конкатенація рядка 'number' з числом 3 перетворює число 3 у рядок.
// Після цього відбувається ще одна конкатенація рядків.
// Результат: 'number33'.

// null + 3
// null перетворюється у 0 в математичних операціях.
// Додавання 0 + 3.
// Результат: 3.

// 5 && "qwerty"
// Логічний оператор && повертає перший операнд, якщо він перетворюється у false. В іншому випадку, повертає другий операнд.
// 5 перетворюється у true, тому повертається "qwerty".
// Результат: "qwerty".

// +'40' + +'2' + "hillel"
// Унарний плюс перетворює рядок у число.
// Додаємо числа: 40 + 2.
// Конкатенація результату з рядком "hillel".
// Результат: "42hillel".

// '10' - 5 === 6
// '10' перетворюється у 10.
// Вираз 10 - 5 рівний 5.
// Тепер ми порівнюємо 5 === 6, що дає false.
// Результат: false.

// true + false
// Логічне значення true перетворюється у 1, а false у 0.
// Додавання: 1 + 0.
// Результат: 1.

// '4px' - 3
// Рядок '4px' не може бути віднімним.
// JavaScript намагається перетворити рядок у число, відкидаючи небуквенні символи. Отже, '4px' перетворюється у 4.
// Тепер відбувається віднімання: 4 - 3.
// Результат: 1.

// '4' - 3
// '4' перетворюється у 4.
// Відбувається віднімання: 4 - 3.
// Результат: 1.

// '6' + 3 ** 0
// '6' перетворюється у 6.
// Операція піднесення до степеня: 3 ** 0 дає 1.
// Додавання: 6 + 1.
// Результат: 7.

// 12 / '6'
// '6' перетворюється у 6.
// Ділення: 12 / 6.
// Результат: 2.

// '10' + (5 === 6)
// (5 === 6) дає false.
// Конкатенація рядків: '10' + false.
// Результат: '10false'.

// null == ''
// null у порівнянні з будь-яким іншим типом даних, крім undefined, перетворюється у false.
// Порівнюємо: false == ''.
// Порожній рядок '' перетворюється у false.
// Результат: true.

// 3 ** (9 / 3)
// Операція у скобках: 9 / 3 дає 3.
// Операція піднесення до степеня: 3 ** 3.
// Результат: 27.

// !!'false' == !!'true'
// Обидва рядки перетворюються в true через дві унарні оператори !!.
// Порівнюємо: true == true.
// Результат: true.

// 0 || '0' && 1
// 0 || '0' дає '0' (перший істинний операнд у логічному ||).
// '0' && 1 дає 1 (обидва операнди істинні у логічному &&).
// Результат: 1.

// (+null == false) < 1
// +null перетворюється у 0.
// Порівнюємо: 0 == false.
// false перетворюється у 0.
// Порівнюємо: 0 < 1.
// Результат: true.

// false && true || true
// false && true дає false (перший хибний операнд у &&).
// false || true дає true (другий істинний операнд у ||).
// Результат: true.

// false && (false || true)
// false || true дає true.
// false && true дає false.
// Результат: false.

// (+null == false) < 1 ** 5
// +null перетворюється у 0.
// Порівнюємо: 0 == false.
// false перетворюється у 0.
// Порівнюємо: 0 < 1 ** 5.
// 1 ** 5 дає 1.
// Порівнюємо: 0 < 1.
// Результат: true.